{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"color_scheme":"scheme-2","padding_top":28,"padding_bottom":28}},"page_U3nCzB":{"type":"page","settings":{"page":"price-match-guarantee","heading_size":"h1","color_scheme":"scheme-2","show_page_description":false,"padding_top":36,"padding_bottom":36}},"rich_text_atPzKT":{"type":"rich-text","blocks":{"heading_j8QY7P":{"type":"heading","settings":{"heading":"What Is Price Match?","heading_size":"h1","heading_align":"center"}},"text_Cxi9qA":{"type":"text","settings":{"text":"<p>Price Match is our guarantee that you are getting the BEST possible PRICE on lab grown diamonds in the market. If you feel that another U.S. retailer offers a similar diamond at a better price, we'll match it. Easy as that. Since we source our lab created diamonds directly from the diamond growers, we can assure you that our pricing is the most competitive in the market today.<\/p>"}}},"block_order":["heading_j8QY7P","text_Cxi9qA"],"settings":{"show_section_border_top":false,"desktop_content_position":"left","content_alignment":"left","color_scheme":"scheme-1","full_width":false,"additional_class":"only_text_section","padding_top":60,"padding_bottom":60}},"rich_text_HewmKV":{"type":"rich-text","blocks":{"heading_YGgtGb":{"type":"heading","settings":{"heading":"How Do You Price Match?","heading_size":"h1","heading_align":"center"}},"text_7Qgan8":{"type":"text","settings":{"text":"<p>A couple of points to keep in mind before you price match:<\/p><ul><li>Price match is for loose diamonds only, and it does not cost you anything to use this service.<\/li><li>Our Grown Brilliance Customer Service team members are full-time employees who are trained to ensure the most fair evaluation of your Price Match request.<\/li><li>Our Customer Service team does NOT work on commissions, so they are in no way incented to sell you GB diamonds. They will assess your request in a fair manner and ensure accuracy of the match.<\/li><\/ul><p>To start, compare our loose diamonds to any retailer's loose lab grown diamond of the same quality. Please be sure to compare apples to apples when reviewing the diamonds. This includes all 4 Cs: Carat weight, Cut (including the shape), Color, and Clarity. These four diamond attributes need to be the same between the two compared diamonds. Please make sure that the diamond you evaluating, is sold on a public-facing website domain of a legitimate retailer, and not a private seller. If you feel that our diamond is more expensive than another retailer's diamond (with the same parameters of the 4 Cs), then please contact <a href=\"https:\/\/support.grownbrilliance.com\/hc\/en-us\">Customer Service<\/a> or call us at 877-476-9627, and one of our qualified agents will be glad to assist you. If all the parameters are exactly the same, and our price is higher, we will match the lower price you found, that is a promise!<\/p>"}}},"block_order":["heading_YGgtGb","text_7Qgan8"],"settings":{"show_section_border_top":true,"desktop_content_position":"left","content_alignment":"left","color_scheme":"scheme-1","full_width":false,"additional_class":"only_text_section","padding_top":62,"padding_bottom":60}},"rich_text_aCjkWY":{"type":"rich-text","blocks":{"heading_RePtVB":{"type":"heading","settings":{"heading":"Why Only Price Match On Loose Diamonds?","heading_size":"h1","heading_align":"center"}},"text_eq8af3":{"type":"text","settings":{"text":"<p>Every piece of hand-crafted jewelry is unique; unique in style, carat total weight, gold weight, dimensions, and the way it is created. Even the craftsmanship differs from jeweler to jeweler, which includes diamond setting techniques, the number of times it is polished, as well as the thickness of the rhodium plating. Hence, it is impossible to compare it with another similar piece in a fair manner. To keep things simple, we avoid matching prices on any finished piece of jewelry for all the reasons listed here.<\/p><p>Nevertheless, we can assure you that with our expert bench jewelers, meticulous setting techniques, and stringent quality control procedures, we will deliver to you an exquisite piece of jewelry at our very best price, and likely the best price in the market. You will find true value and beauty in every piece of Grown Brilliance lab created diamond jewelry. We thrive on our customers' satisfaction, so nothing would give us more pleasure than making sure that your special piece is exactly what you expect it to be. If, by any chance, you are dissatisfied with our jewelry, please feel free to email <a href=\"https:\/\/support.grownbrilliance.com\/hc\/en-us\">Customer Service<\/a>, or call <a href=\"tel:877-476-9627\" title=\"tel:877-476-9627\">877-476-9627<\/a> with your concern. Our team is available to answer your questions.<\/p>"}}},"block_order":["heading_RePtVB","text_eq8af3"],"settings":{"show_section_border_top":true,"desktop_content_position":"left","content_alignment":"left","color_scheme":"scheme-1","full_width":false,"additional_class":"only_text_section","padding_top":62,"padding_bottom":60}},"rich_text_G6hmTw":{"type":"rich-text","blocks":{"heading_GPDAf6":{"type":"heading","settings":{"heading":"Price Match Guarantee Terms & Conditions","heading_size":"h1","heading_align":"center"}},"text_DeRJGW":{"type":"text","settings":{"text":"<ul><li>Price Match is only available on loose lab grown diamonds, and not finished\/complete pieces of jewelry. Diamonds available to be set in our Design Your Engagement Ring section are eligible for Price Match review.<\/li><li>Price Match is not available for Special Orders through our Truly Custom program, as we choose the best premium diamonds for your Truly Custom order, based on your requested diamond specifications.<\/li><li>The competing price should be publicly visible to all, and cannot be a unique or individual sale. Diamond marketplace sites that average listings from other retailers are not eligible for the pricematch program.<\/li><li>The two lab created diamonds being compared must have the same characteristics of carat weight, cut, color and clarity, as well as the shape. Grown Brilliance agents will have the sole discretion of whether or not the diamonds are comparable.<\/li><li>The Price Match Guarantee is applicable only before you make your purchase with us. We will not, in any circumstance, issue a partial refund due to a Price Match requested after the purchase is made.<\/li><li>To authenticate the compared pricing, the customer must provide our diamond consultants with a link to the competitor's diamond. All Price Match requests must be made via email to <a href=\"https:\/\/support.grownbrilliance.com\/hc\/en-us\">Customer Service<\/a>.<\/li><li>The diamond must be from a legitimate certified retailer and not an individual or private seller. Price Match Guarantee is not eligible for resale or commercial uses.<\/li><li>The lower price must be in effect at the time that your request is being verified by Grown Brilliance.We will not entertain expired offers or prices.<\/li><li>Pricing of the competitor's diamond must be in USD.<\/li><li>The competitor's diamond should be an item that can be purchased at the time of comparison and should be in-stock.<\/li><li>Special promotions by the competitor such as rebates, gift certificates, bundled products and \"buy one, get one\" offers are not eligible for the Price Match Guarantee.<\/li><li>Pawn shops and auctions (websites or brick & mortar stores) are ineligible for the Price Match Guarantee.<\/li><li>The Price Match Guarantee cannot be combined with any other Grown Brilliance offer, including GB Cash, Free or Discounted Ring Promotion through our Design Your Ring program, GWP, subscriber offers, or other select coupon codes.<\/li><li>The Price Match Guarantee cannot be combined with any third party, influencer, or affiliate partner offers including offers, coupons, loyalty, rebate, or reward partnerships.<\/li><li>The Price Match evaluation by our agents may take up to two (2) business days. Customer will be informed of the decision, and should the Price Match be awarded, a one-time coupon code matching the price will be issued via email.<\/li><\/ul>"}}},"block_order":["heading_GPDAf6","text_DeRJGW"],"settings":{"show_section_border_top":true,"desktop_content_position":"left","content_alignment":"left","color_scheme":"scheme-1","full_width":false,"additional_class":"only_text_section","padding_top":62,"padding_bottom":60}}},"order":["main","page_U3nCzB","rich_text_atPzKT","rich_text_HewmKV","rich_text_aCjkWY","rich_text_G6hmTw"]}